org-pm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org-publish-meta: Easy projects for Org-mode</title>
<!-- 2013-12-30 Mon 00:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="I Z" />
<link href="./static/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="./static/worg.min.css" rel="stylesheet" type="text/css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./"> HOME </a>
</div><div id="content">
<h1 class="title">Org-publish-meta: Easy projects for Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Variables</a>
<ul>
<li><a href="#sec-1-1">org-pm-project-data-file-path</a></li>
<li><a href="#sec-1-2">org-pm-files</a></li>
<li><a href="#sec-1-3">org-pm-project-def-duplicates</a></li>
<li><a href="#sec-1-4">org-pm-auto-parse</a></li>
<li><a href="#sec-1-5">org-pm-auto-copy</a></li>
<li><a href="#sec-1-6">org-pm-project-template-file-name</a></li>
<li><a href="#sec-1-7">org-pm-default-project-name</a></li>
<li><a href="#sec-1-8">org-pm-default-project-org-folder</a></li>
<li><a href="#sec-1-9">org-pm-default-project-html-folder</a></li>
<li><a href="#sec-1-10">org-pm-default-project-plist</a></li>
</ul>
</li>
<li><a href="#sec-2">Auxiliary functions</a>
<ul>
<li><a href="#sec-2-1">Get header properties</a></li>
<li><a href="#sec-2-2">Get drawer contents</a></li>
<li><a href="#sec-2-3">Comment out the rest of a section following a comment line</a></li>
<li><a href="#sec-2-4">Functions for adding, removing and replacing elements in a-lists</a></li>
<li><a href="#sec-2-5">org-pm-make-default-project-alist</a></li>
<li><a href="#sec-2-6">org-pm-add-project-file</a></li>
<li><a href="#sec-2-7">org-pm-remove-project-file</a></li>
<li><a href="#sec-2-8">org-pm-add-project-to-file-header</a></li>
<li><a href="#sec-2-9">org-pm-get-section-projects</a></li>
<li><a href="#sec-2-10">org-pm-edit-project-template</a></li>
<li><a href="#sec-2-11">org-pm-edit-saved-project-data</a></li>
<li><a href="#sec-2-12">org-pm-show-project-definition-section</a></li>
<li><a href="#sec-2-13">org-pm-make-project-template</a></li>
<li><a href="#sec-2-14">Providing relative paths to root of published project</a></li>
<li><a href="#sec-2-15">Customizing the heading of table of contents</a></li>
</ul>
</li>
<li><a href="#sec-3">Setup auto-parse and auto-copy</a></li>
<li><a href="#sec-4">Main functions and commands</a>
<ul>
<li><a href="#sec-4-1">org-pm-do-auto / org-pm-dont-auto</a></li>
<li><a href="#sec-4-2">org-pm-load-all-project-data</a></li>
<li><a href="#sec-4-3">org-pm-save-all-project-data</a></li>
<li><a href="#sec-4-4">org-pm-reset-project-list</a></li>
<li><a href="#sec-4-5">org-pm-make-projects</a></li>
<li><a href="#sec-4-6">org-pm-parse-project-def</a></li>
<li><a href="#sec-4-7">org-pm-check-add-project</a></li>
<li><a href="#sec-4-8">org-pm-add-file-to-project:</a></li>
<li><a href="#sec-4-9">query-make-folder</a></li>
<li><a href="#sec-4-10">org-pm-remove-file-from-project:</a></li>
<li><a href="#sec-4-11">org-pm-add-component-to-project</a></li>
<li><a href="#sec-4-12">org-pm-remove-component-from-project</a></li>
<li><a href="#sec-4-13">org-pm-copy-components-to-projects</a></li>
<li><a href="#sec-4-14">org-pm-publish: Select a project to publish from the projects targeted by current buffer.</a></li>
<li><a href="#sec-4-15">org-pm-enable-auto:</a></li>
<li><a href="#sec-4-16">org-pm-disable-auto:</a></li>
<li><a href="#sec-4-17">org-pm-list-dupicate-project-defs</a></li>
<li><a href="#sec-4-18">org-pm-list-project-defs</a>
<ul>
<li><a href="#sec-4-18-1">org-pm-search-link</a></li>
</ul>
</li>
<li><a href="#sec-4-19">pm/edit-duplicate-project-def</a></li>
</ul>
</li>
<li><a href="#sec-5">Keyboard shortcuts</a></li>
<li><a href="#sec-6">Cleaning up duplicate links and dead projects+files</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Variables</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><a id="ID-A71224C0-989C-419B-A7B6-2B0CEC64CEE7" name="ID-A71224C0-989C-419B-A7B6-2B0CEC64CEE7"></a>org-pm-project-data-file-path</h3>
<div class="outline-text-3" id="text-1-1">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-project-data-file-path</span>
  (<span style="color: #728a05;">let</span> ((home (file-truename <span style="color: #259185;">"~/.emacs.d"</span>)))
      (<span style="color: #728a05;">cond</span>
       ((file-exists-p home)
        (setq home (concat home <span style="color: #259185;">"/savefile"</span>))
        (<span style="color: #728a05;">unless</span> (file-exists-p home) (make-directory home))
        (concat home <span style="color: #259185;">"/org-pm-project.data.el"</span>))
       (t (concat home <span style="color: #259185;">"/.org-pm-project.data.el"</span>))))
  <span style="color: #465a61; font-style: italic;">"Path of file for storing org-publish-project-alist and</span>
<span style="color: #465a61; font-style: italic;">org-pm-files.  If nil, the path is deduced from the existence</span>
<span style="color: #465a61; font-style: italic;">of .emacs.d folder in user's home directory.</span>
<span style="color: #465a61; font-style: italic;">If .emacs.d exists, use ~/.emacs.d/savefile/org-publish-project-alist</span>
<span style="color: #465a61; font-style: italic;">else use ~/.org-publish-project-alist.</span>
<span style="color: #465a61; font-style: italic;">Create savefile folder if it does not exist."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><a id="ID-A8ABC239-E74B-4654-9850-53C8521E50BA" name="ID-A8ABC239-E74B-4654-9850-53C8521E50BA"></a>org-pm-files</h3>
<div class="outline-text-3" id="text-1-2">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-files</span> nil
<span style="color: #465a61; font-style: italic;">"List of files to be copied to projects.</span>
<span style="color: #465a61; font-style: italic;">For each file, store a list starting with the full path of the file, and</span>
<span style="color: #465a61; font-style: italic;">followed by the list of projects specified in the file</span>
<span style="color: #465a61; font-style: italic;">or any of its sections:</span>
<span style="color: #465a61; font-style: italic;">  (full-path-of-file project1 project2 ...)</span>
<span style="color: #465a61; font-style: italic;">Function org-pm-register-project-components scans a file, creates its list</span>
<span style="color: #465a61; font-style: italic;">and puts it in org-pm-files.</span>
<span style="color: #465a61; font-style: italic;">Function org-pm-copy-to-project searches through all lists in org-pm-files,</span>
<span style="color: #465a61; font-style: italic;">collects the list of files that belong to a project,</span>
<span style="color: #465a61; font-style: italic;">parses each file to find which components should be copied,</span>
<span style="color: #465a61; font-style: italic;">and copies the found components to the project."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">org-pm-project-def-duplicates</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-project-def-duplicates</span> nil
  <span style="color: #465a61; font-style: italic;">"List of links to files/sections which contains project definitions</span>
<span style="color: #465a61; font-style: italic;">that were overwritten because another definition with the same name was found.</span>
<span style="color: #465a61; font-style: italic;">Auto-saved together with org-publish-project-alist and org-pm-files.</span>
<span style="color: #465a61; font-style: italic;">Used to create org-mode buffer with links to these locations.</span>
<span style="color: #465a61; font-style: italic;">See functions:</span>
<span style="color: #465a61; font-style: italic;">- org-pm-check-add-project</span>
<span style="color: #465a61; font-style: italic;">- org-pm-list-dupicate-project-defs</span>
<span style="color: #465a61; font-style: italic;">- org-pm-list-project-defs</span>
<span style="color: #465a61; font-style: italic;">- pm/edit-duplicate-project-def"</span>
)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><a id="ID-03CF07FC-5FD7-46C6-BE11-74C3D339A315" name="ID-03CF07FC-5FD7-46C6-BE11-74C3D339A315"></a>org-pm-auto-parse</h3>
<div class="outline-text-3" id="text-1-4">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-auto-parse</span> t
  <span style="color: #465a61; font-style: italic;">"If not nil, automatically parse a org-mode buffer</span>
<span style="color: #465a61; font-style: italic;"> for org-pm data before saving it."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><a id="ID-3AF37A0C-F14A-41A3-B477-5B12696315BE" name="ID-3AF37A0C-F14A-41A3-B477-5B12696315BE"></a>org-pm-auto-copy</h3>
<div class="outline-text-3" id="text-1-5">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-auto-copy</span> 'on-save
<span style="color: #465a61; font-style: italic;">"If not nil, automatically copy file components to a project to the</span>
<span style="color: #465a61; font-style: italic;">project's source folder before publishing."</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><a id="ID-9D5B4E5D-90E1-4F32-842D-620B262665AF" name="ID-9D5B4E5D-90E1-4F32-842D-620B262665AF"></a>org-pm-project-template-file-name</h3>
<div class="outline-text-3" id="text-1-6">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-project-template-file-name</span>
  (concat (file-name-directory (or load-file-name (buffer-file-name)))
          <span style="color: #259185;">"org-pm-project-template.org"</span>)
<span style="color: #465a61; font-style: italic;">"Full path of file containing template of project definition for</span>
<span style="color: #465a61; font-style: italic;">projects generated automatically with org-pm-make-project-template.</span>
<span style="color: #465a61; font-style: italic;">The path is initialized at code loading time by function org-pm-init-project-template-na</span><span style="color: #706f6f; background-color: #042028;">me.</span>
<span style="color: #465a61; font-style: italic;">org-pm-make-project-template uses it to make project templates."</span>)
</pre>
</div>
</div>
</div>
