org-pm.html
<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13"><a id="ID-36439CB5-E875-4E45-B595-5116888C9DCA" name="ID-36439CB5-E875-4E45-B595-5116888C9DCA"></a>org-pm-make-project-template</h3>
<div class="outline-text-3" id="text-2-13">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-make-project-template</span> (<span style="color: #a57705;">&amp;optional</span> project-name no-name-query no-query)
  <span style="color: #465a61; font-style: italic;">"Create a project definition template and insert it into current file.</span>
<span style="color: #465a61; font-style: italic;">Input project name, base directory and publishing directory from user.</span>
<span style="color: #465a61; font-style: italic;">Skip input step if called with prefix argument.</span>
<span style="color: #465a61; font-style: italic;">Read file containing template of project definition</span>
<span style="color: #465a61; font-style: italic;">from org-pm-project-template-file-name</span>
<span style="color: #465a61; font-style: italic;">If arguments present, replace relevant parts of the template with</span>
<span style="color: #465a61; font-style: italic;">custom name, base-directory, publishing-directory</span>
<span style="color: #465a61; font-style: italic;">Insert the resulting template in the current file.</span>
<span style="color: #465a61; font-style: italic;">Create the project as well as its static project and component project.</span>
<span style="color: #465a61; font-style: italic;">Store all 3 in org-publish-project-alists.</span>
<span style="color: #465a61; font-style: italic;">Save updated project, file and duplicate lists to disk."</span>
  (interactive <span style="color: #259185;">"P"</span>)
  (<span style="color: #728a05;">let*</span> ((base-directory (file-truename <span style="color: #259185;">"~/org-pm/"</span>))
         (publishing-directory
          (file-truename <span style="color: #259185;">"~/Sites/org-pm/"</span>))
         (def-node
           (car (org-map-entries '(cadr (org-element-at-point)) <span style="color: #259185;">"PROJECT_DEFS"</span>)))
         (buffer (get-buffer-create <span style="color: #259185;">"*def*"</span>))
         plist template-string)
    (<span style="color: #728a05;">unless</span> project-name (setq project-name <span style="color: #259185;">"org-pm-default"</span>))
    (<span style="color: #728a05;">unless</span> no-name-query
      (setq project-name (read-string <span style="color: #259185;">"Enter project name: "</span> project-name)))
    (<span style="color: #728a05;">unless</span> no-query
      (setq base-directory (query-make-folder base-directory))
      (setq publishing-directory (query-make-folder publishing-directory)))
    (<span style="color: #728a05;">save-excursion</span>
      (set-buffer buffer)
      (insert-file-contents org-pm-project-template-file-name)
      (beginning-of-buffer)
      (replace-string <span style="color: #259185;">"PROJECTNAME"</span> project-name)
      (beginning-of-buffer)
      (replace-string <span style="color: #259185;">"BASEDIRECTORY"</span> base-directory)
      (beginning-of-buffer)
      (replace-string <span style="color: #259185;">"PUBLISHINGDIRECTORY"</span> publishing-directory)
      (setq template-string (buffer-string))
      (kill-buffer buffer))
    (<span style="color: #728a05;">cond</span> (def-node
           (goto-char (plist-get def-node <span style="color: #728a05;">:begin</span>))
           (end-of-line)
           (insert <span style="color: #259185;">"\n"</span>)
           (org-paste-subtree (+ 1 (plist-get def-node <span style="color: #728a05;">:level</span>)) template-string))
          (t
           (end-of-buffer)
           (insert <span style="color: #259185;">"\n* COMMENT Project Definitions              :PROJECT_DEFS:\n"</span>)
           (org-paste-subtree 2 template-string)))
    (org-id-get-create)
    (org-pm-check-add-project (org-pm-parse-project-def (cadr (org-element-at-point))))
    (org-pm-save-all-project-data)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-14" class="outline-3">
<h3 id="sec-2-14">Providing relative paths to root of published project</h3>
<div class="outline-text-3" id="text-2-14">
<p>
This makes sure that when a file is copied to a subfolder of the publishing directory, the paths pointing to includes such as css, images, etc. will be converted to show to the root of the project, so that links work.  Such links must be marked using the string <code>.</code> to denote the relative root to the published project, that is, the <code>publishing-directory</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-html-provide-relative-path</span> (string backend info)
  <span style="color: #465a61; font-style: italic;">"Provide relative path for link."</span>
  (<span style="color: #728a05;">when</span> (org-export-derived-backend-p backend 'html)
    (replace-regexp-in-string
     <span style="color: #259185;">"."</span>
     (org-make-relpath-string
      (plist-get info <span style="color: #728a05;">:publishing-directory</span>)
      (plist-get info '<span style="color: #728a05;">:input-file</span>))
     string)))

<span style="color: #465a61; font-style: italic;">;;; </span><span style="color: #465a61; font-style: italic;">Add relative path filter to export final output functions</span>
(add-to-list 'org-export-filter-final-output-functions
             'org-html-provide-relative-path)

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-make-relpath-string</span> (base-path file-path)
  <span style="color: #465a61; font-style: italic;">"create a relative path for reaching base-path from file-path ('./../..' etc)"</span>
  (<span style="color: #728a05;">let</span> (
        (path <span style="color: #259185;">"."</span>)
        (depth (-
                (length (split-string (file-name-directory file-path) <span style="color: #259185;">"/"</span>))
                (length (split-string base-path <span style="color: #259185;">"/"</span>)))))
    (<span style="color: #728a05;">dotimes</span> (number
              (- depth 1)
              path)
      (setq path (concat path <span style="color: #259185;">"/.."</span>)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-15" class="outline-3">
<h3 id="sec-2-15">Customizing the heading of table of contents</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-html-toc</span> (depth info)
  <span style="color: #465a61; font-style: italic;">"Build a table of contents.</span>
<span style="color: #465a61; font-style: italic;">DEPTH is an integer specifying the depth of the table.  INFO is a</span>
<span style="color: #465a61; font-style: italic;">plist used as a communication channel.  Return the table of</span>
<span style="color: #465a61; font-style: italic;">contents as a string, or nil if it is empty."</span>
  (<span style="color: #728a05;">let</span> ((toc-heading (plist-get info <span style="color: #728a05;">:toc-heading</span>))
        (toc-entries
         (mapcar (<span style="color: #728a05;">lambda</span> (headline)
                   (cons (org-html--format-toc-headline headline info)
                         (org-export-get-relative-level headline info)))
                 (org-export-collect-headlines info depth)))
        (outer-tag (<span style="color: #728a05;">if</span> (and (org-html-html5-p info)
                            (plist-get info <span style="color: #728a05;">:html-html5-fancy</span>))
                       <span style="color: #259185;">"nav"</span>
                     <span style="color: #259185;">"div"</span>)))
    (<span style="color: #728a05;">when</span> toc-entries
      (<span style="color: #728a05;">unless</span> toc-heading (setq toc-heading <span style="color: #259185;">"Table of Contents"</span>))
      (concat (format <span style="color: #259185;">"&lt;%s id=\"table-of-contents\"&gt;\n"</span> outer-tag)
              (format <span style="color: #259185;">"&lt;h%d&gt;%s&lt;/h%d&gt;\n"</span>
                      org-html-toplevel-hlevel
                      (org-html--translate toc-heading info)
                      org-html-toplevel-hlevel)
              <span style="color: #259185;">"&lt;div id=\"text-table-of-contents\"&gt;"</span>
              (org-html--toc-text toc-entries)
              <span style="color: #259185;">"&lt;/div&gt;\n"</span>
              (format <span style="color: #259185;">"&lt;/%s&gt;\n"</span> outer-tag)))))
</pre>
</div>
</div>
</div>
</div>
