org-pm.org
* Setup auto-parse and auto-copy

#+BEGIN_SRC emacs-lisp

  (add-hook 'after-save-hook 'org-pm-maybe-parse-and-copy)

  (defun org-pm-maybe-parse-and-copy ()
    "This function is run whenever a file is saved.
  If org-pm-auto-parse is true, make projects whose definitions are in this buffer.
  If org-pm-auto-copy is set to 'on-save, then copy the file and sections
  specified to their project base directory folders."
    (when (equal major-mode 'org-mode)
      (if org-pm-auto-parse
          ;; if org-pm-auto-copy is not nil, then don't save here:
          (org-pm-make-projects org-pm-auto-copy))
      (if (equal org-pm-auto-copy 'on-save)
          ;; Always save if running this.
          (org-pm-copy-components-to-projects))))
#+END_SRC

* Main functions and commands
:PROPERTIES:
:DATE:     <2013-12-18 Wed 11:16>
:END:

** Auto-saving and parsing of documents on save

#+BEGIN_SRC emacs-lisp
  (defun org-pm-toggle-auto ()
    (interactive)
    (setq org-pm-auto-parse (not org-pm-auto-parse))
    (if org-pm-auto-parse ;; stay in sync with auto parse!
        (setq org-pm-auto-copy 'on-save)
      (setq org-pm-auto-copy nil))
    (if org-pm-auto-parse
        (message "Org-pm auto-save and copy activated.")
      (message "Org-pm auto-save and copy deactivated.")))

  (defun org-pm-save-and-update ()
    (interactive)
    (org-edit-src-save)
    (org-pm-make-projects)
    (org-pm-copy-components-to-projects))

  (defun org-pm-toggle-verbose ()
    (interactive)
    (setq org-pm-report-after-copying-p (not org-pm-report-after-copying-p))
    (if org-pm-report-after-copying-p
        (message "Reporting after copying activated")
      (message "Reporting after copying deactivated")))
#+END_SRC
*** org-pm-do-auto / org-pm-dont-auto

Utility functions

#+BEGIN_SRC emacs-lisp
  (defun org-pm-do-auto ()
    (interactive)
    (setq org-pm-auto-parse t)
    (setq org-pm-auto-copy 'on-save))

  (defun org-pm-dont-auto ()
    (interactive)
    (setq org-pm-auto-parse nil)
    (setq org-pm-auto-copy nil))
#+END_SRC
** Persistence: Saving and loading project data
*** org-pm-load-all-project-data

#+BEGIN_SRC emacs-lisp
  (defun org-pm-load-all-project-data ()
    "Load project alist, project file lists, duplicate project def lists
  from previously saved date on disk."
    (interactive)
    (if (file-exists-p org-pm-project-data-file-path)
        (load-file org-pm-project-data-file-path)))
#+END_SRC

#+RESULTS:
: org-pm-load-all-project-data

*** org-pm-save-all-project-data

#+BEGIN_SRC emacs-lisp
  (defun org-pm-save-all-project-data ()
    "Load project alist, project file lists, duplicate project def lists
  from previously saved date on disk."
    (interactive)
    (dump-vars-to-file
     '(org-publish-project-alist org-pm-files org-pm-project-def-duplicates)
     org-pm-project-data-file-path))

  (defun dump-vars-to-file (varlist filename)
    "simplistic dumping of variables in VARLIST to a file FILENAME"
    (save-excursion
      (let ((buf (find-file-noselect filename)))
        (set-buffer buf)
        (erase-buffer)
        (dump varlist buf)
        (save-buffer)
        (kill-buffer))))

  (defun dump (varlist buffer)
    "insert into buffer the setq statement to recreate the variables in VARLIST"
    (loop for var in varlist do
          (print (list 'setq var (list 'quote (symbol-value var)))
                 buffer)))
#+END_SRC

** Creating and managing project definitions

*** org-pm-reset-project-list / org-pm-clear-project-defs

#+BEGIN_SRC emacs-lisp
  (defun org-pm-reset-project-list ()
    "Set org-publish-project-alist to nil.  Save"
    (interactive)
    (cond ((y-or-n-p "Really erase all projects and save?")
           (setq org-publish-project-alist)
           (org-pm-save-all-project-data))))
#+END_SRC

*** DONE org-pm-make-projects
#+BEGIN_SRC emacs-lisp
  (defun org-pm-make-projects (&optional do-not-save-now)
    "Construct the projects for all project definitions found in current file.
  Project definitions are those nodes which are contained in nodes tagged as
  PROJECT_DEFS.
  Note about project definition node-IDs:
  Section IDs of project definitions are used only as links
  to point to the position in the file where a project definition is, located.
  They do nod identify a project.  A project is identified by its name.
  Therefore:
  The node-id of a project is set to <full-file-path>::#<section id>.
  When a duplicate section id is found in a definition, it is replaced by a new one,
  and the new id is stored in the project."
    (interactive)
    (unless org-publish-project-alist (org-pm-load-all-project-data))
    (let (
          ;; abandoning template IZ Jan 5, 2014 (6:28 PM)
          ;; (template (org-pm-make-default-project-plist))
          levels id ids projects)
      (org-map-entries
       '(let
            ((entry (cadr (org-element-at-point))))
          (if (member "PROJECT_DEFS" (plist-get entry :tags))
              (setq levels (cons (+ 1 (plist-get entry :level)) levels)))
          (when (equal (car levels) (plist-get entry :level))
            (setq id (org-id-get-create))
            (when (member id ids)
              (org-delete-property "ID")
              (setq id (org-id-get-create))
              (setq entry (plist-put entry :ID id)))
            (setq ids (cons id ids))
            ;; (setq projects (cons (org-pm-parse-project-def entry template) projects))
            (setq projects (cons (org-pm-parse-project-def entry) projects))
            ))
       "PROJECT_DEFS")
      (mapcar 'org-pm-check-add-project projects)
      (unless do-not-save-now (org-pm-save-all-project-data))
      (message "Org-pm defined %d projects" (length projects))))
#+END_SRC

