org-pm.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Setup auto-parse and auto-copy</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'after-save-hook 'org-pm-maybe-parse-and-copy)

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-maybe-parse-and-copy</span> ()
  <span style="color: #465a61; font-style: italic;">"This function is run whenever a file is saved.</span>
<span style="color: #465a61; font-style: italic;">If org-pm-auto-parse is true, make projects whose definitions are in this buffer.</span>
<span style="color: #465a61; font-style: italic;">If org-pm-auto-copy is set to 'on-save, then copy the file and sections</span>
<span style="color: #465a61; font-style: italic;">specified to their project base directory folders."</span>
  (<span style="color: #728a05;">when</span> (equal major-mode 'org-mode)
    (<span style="color: #728a05;">if</span> org-pm-auto-parse
        <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">if org-pm-auto-copy is not nil, then don't save here:</span>
        (org-pm-make-projects org-pm-auto-copy))
    (<span style="color: #728a05;">if</span> (equal org-pm-auto-copy 'on-save)
        <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">Always save if running this.</span>
        (org-pm-copy-components-to-projects))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Main functions and commands</h2>
<div class="outline-text-2" id="text-4">
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">org-pm-do-auto / org-pm-dont-auto</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Utility functions
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-do-auto</span> ()
  (interactive)
  (setq org-pm-auto-parse t)
  (setq org-pm-auto-copy 'on-save))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-dont-auto</span> ()
  (interactive)
  (setq org-pm-auto-parse nil)
  (setq org-pm-auto-copy nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">org-pm-load-all-project-data</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-load-all-project-data</span> ()
  <span style="color: #465a61; font-style: italic;">"Load project alist, project file lists, duplicate project def lists</span>
<span style="color: #465a61; font-style: italic;">from previously saved date on disk."</span>
  (interactive)
  (<span style="color: #728a05;">if</span> (file-exists-p org-pm-project-data-file-path)
      (load-file org-pm-project-data-file-path)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">org-pm-save-all-project-data</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-save-all-project-data</span> ()
  <span style="color: #465a61; font-style: italic;">"Load project alist, project file lists, duplicate project def lists</span>
<span style="color: #465a61; font-style: italic;">from previously saved date on disk."</span>
  (interactive)
  (dump-vars-to-file
   '(org-publish-project-alist org-pm-files org-pm-project-def-duplicates)
   org-pm-project-data-file-path))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">dump-vars-to-file</span> (varlist filename)
  <span style="color: #465a61; font-style: italic;">"simplistic dumping of variables in VARLIST to a file FILENAME"</span>
  (<span style="color: #728a05;">save-excursion</span>
    (<span style="color: #728a05;">let</span> ((buf (find-file-noselect filename)))
      (set-buffer buf)
      (erase-buffer)
      (dump varlist buf)
      (save-buffer)
      (kill-buffer))))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">dump</span> (varlist buffer)
  <span style="color: #465a61; font-style: italic;">"insert into buffer the setq statement to recreate the variables in VARLIST"</span>
  (<span style="color: #728a05;">loop</span> for var in varlist do
        (print (list 'setq var (list 'quote (symbol-value var)))
               buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">org-pm-reset-project-list</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-reset-project-list</span> ()
  <span style="color: #465a61; font-style: italic;">"Set org-publish-project-alist to nil.  Save"</span>
  (interactive)
  (<span style="color: #728a05;">cond</span> ((y-or-n-p <span style="color: #259185;">"Really erase all projects and save?"</span>)
         (setq org-publish-project-alist)
         (org-pm-save-all-project-data))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5">org-pm-make-projects</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-make-projects</span> (<span style="color: #a57705;">&amp;optional</span> do-not-save-now)
  <span style="color: #465a61; font-style: italic;">"Construct the projects for all project definitions found in current file.</span>
<span style="color: #465a61; font-style: italic;">Project definitions are those nodes which are contained in nodes tagged as</span>
<span style="color: #465a61; font-style: italic;">PROJECT_DEFS.</span>
<span style="color: #465a61; font-style: italic;">Note about project definition node-IDs:</span>
<span style="color: #465a61; font-style: italic;">Section IDs of project definitions are used only as links</span>
<span style="color: #465a61; font-style: italic;">to point to the position in the file where a project definition is, located.</span>
<span style="color: #465a61; font-style: italic;">They do nod identify a project.  A project is identified by its name.</span>
<span style="color: #465a61; font-style: italic;">Therefore:</span>
<span style="color: #465a61; font-style: italic;">The node-id of a project is set to &lt;full-file-path&gt;::#&lt;section id&gt;.</span>
<span style="color: #465a61; font-style: italic;">When a duplicate section id is found in a definition, it is replaced by a new one,</span>
<span style="color: #465a61; font-style: italic;">and the new id is stored in the project."</span>
  (interactive)
  (<span style="color: #728a05;">unless</span> org-publish-project-alist (org-pm-load-all-project-data))
  (<span style="color: #728a05;">let</span> ((template (org-pm-make-default-project-plist))
        levels id ids projects)
    (org-map-entries
     '(<span style="color: #728a05;">let</span>
          ((entry (cadr (org-element-at-point))))
        (<span style="color: #728a05;">if</span> (member <span style="color: #259185;">"PROJECT_DEFS"</span> (plist-get entry <span style="color: #728a05;">:tags</span>))
            (setq levels (cons (+ 1 (plist-get entry <span style="color: #728a05;">:level</span>)) levels)))
        (<span style="color: #728a05;">when</span> (equal (car levels) (plist-get entry <span style="color: #728a05;">:level</span>))
          (setq id (org-id-get-create))
          (<span style="color: #728a05;">when</span> (member id ids)
            (org-delete-property <span style="color: #259185;">"ID"</span>)
            (setq id (org-id-get-create))
            (setq entry (plist-put entry <span style="color: #728a05;">:ID</span> id)))
          (setq ids (cons id ids))
          (setq projects (cons (org-pm-parse-project-def entry template) projects))))
     <span style="color: #259185;">"PROJECT_DEFS"</span>)
    (mapcar 'org-pm-check-add-project projects)
    (<span style="color: #728a05;">unless</span> do-not-save-now (org-pm-save-all-project-data))
    (message <span style="color: #259185;">"Org-pm defined %d projects"</span> (length projects))))
</pre>
</div>
</div>
</div>
