org-pm.html
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6">org-pm-parse-project-def</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-parse-project-def</span> (proj-node <span style="color: #a57705;">&amp;optional</span> template)
  <span style="color: #465a61; font-style: italic;">"Create a project definition list based on the contents of the</span>
<span style="color: #465a61; font-style: italic;">section described in proj-node plist. Convert headings</span>
<span style="color: #465a61; font-style: italic;">to property names and contents to their values.</span>
<span style="color: #465a61; font-style: italic;">Add useful identification data.</span>
<span style="color: #465a61; font-style: italic;">Argument template is a plist with additional properties,</span>
<span style="color: #465a61; font-style: italic;">but may be left out if the section contains all the properties needed</span>
<span style="color: #465a61; font-style: italic;">to define the project."</span>
  (<span style="color: #728a05;">unless</span> org-publish-project-alist (org-pm-load-all-project-data))
  (<span style="color: #728a05;">let</span> ((pdef (copy-sequence template))
        (pname (plist-get proj-node <span style="color: #728a05;">:raw-value</span>))
        (begin (plist-get proj-node <span style="color: #728a05;">:contents-begin</span>))
        (node-id (plist-get proj-node <span style="color: #728a05;">:ID</span>))
        (file-name (buffer-file-name (current-buffer))))
    (setq pdef (plist-put pdef <span style="color: #728a05;">:project-name</span> pname))
    (setq pdef (plist-put pdef <span style="color: #728a05;">:node-id</span> node-id))
    (setq pdef (plist-put pdef <span style="color: #728a05;">:node-filename</span> file-name))
    (setq pdef (plist-put pdef <span style="color: #728a05;">:project-id</span> (concat file-name <span style="color: #259185;">"::#"</span> node-id)))
    (setq pdef (plist-put pdef <span style="color: #728a05;">:last-updated</span> (format-time-string <span style="color: #259185;">"[%Y-%m-%d %a %H:%M]"</span>))<span style="color: #706f6f; background-color: #042028;">)</span>
    (<span style="color: #728a05;">cond</span>
     (begin
      (<span style="color: #728a05;">save-excursion</span>
        (<span style="color: #728a05;">save-restriction</span>
          (narrow-to-region begin (plist-get proj-node <span style="color: #728a05;">:contents-end</span>))
          (org-map-entries
           '(<span style="color: #728a05;">let*</span> (
                   (element (cadr (org-element-at-point)))
                   (heading (plist-get element <span style="color: #728a05;">:raw-value</span>))
                   (space (string-match <span style="color: #259185;">" .*"</span> heading))
                   prop-name prop-value contents-begin)
              (<span style="color: #728a05;">cond</span>
               (space
                (setq prop-name (substring heading 0 space))
                (setq prop-value (eval (read (substring heading space))))
                (<span style="color: #728a05;">if</span> (and
                     (equal prop-name <span style="color: #259185;">"include-containing-file"</span>)
                     prop-value)
                    (org-pm-add-component
                     pname (buffer-file-name (current-buffer)) prop-value)))
               (t (setq prop-name heading)
                  (setq contents-begin (plist-get element <span style="color: #728a05;">:contents-begin</span>))
                  (<span style="color: #728a05;">if</span> contents-begin
                      (setq
                       prop-value
                       (buffer-substring-no-properties
                        contents-begin
                        (plist-get element <span style="color: #728a05;">:contents-end</span>))))))
              (setq pdef
                    (plist-put pdef (intern (concat <span style="color: #259185;">":"</span> prop-name)) prop-value))))))))
    (cons pname pdef)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7">org-pm-check-add-project</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">require</span> '<span style="color: #259185;">dash</span>)
(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-check-add-project</span> (project)
  <span style="color: #465a61; font-style: italic;">"Add the project definition contained in plist 'project' to org-publish-project-alist,</span>
<span style="color: #465a61; font-style: italic;">replacing any previously existing definition there.  Before replacing, save any</span>
<span style="color: #465a61; font-style: italic;">previously existing project whose definition is in a different file component in</span>
<span style="color: #465a61; font-style: italic;">the variable org-pm-project-def-duplicates:</span>
<span style="color: #465a61; font-style: italic;">If a project with the same name already exists in org-publish-project-alist,</span>
<span style="color: #465a61; font-style: italic;">and that project has a different ID (file path + section ID), then the previously</span>
<span style="color: #465a61; font-style: italic;">existing project definition is added to the list in org-pm-project-def-duplicates.</span>
<span style="color: #465a61; font-style: italic;">Also create static and combined project components.</span>
<span style="color: #465a61; font-style: italic;">Create alternate ids for the latter, by appending -static and -combined</span>
<span style="color: #465a61; font-style: italic;">to the id of the main project."</span>
  (<span style="color: #728a05;">unless</span> org-publish-project-alist (org-pm-load-all-project-data))
  (<span style="color: #728a05;">let*</span> ((p-name (car project))
         (p-def (cdr project))
         (prev-proj (assoc p-name org-publish-project-alist))
         (prev-proj-id (plist-get (cdr prev-proj) <span style="color: #728a05;">:project-id</span>))
         (duplicates (assoc p-name org-pm-project-def-duplicates))
         static-project static-project-name combined-project)
    (<span style="color: #728a05;">cond</span>
     ((not prev-proj))
     ((equal prev-proj-id (plist-get p-def <span style="color: #728a05;">:project-id</span>)))
     (t (setq
         org-pm-project-def-duplicates
         (assoc-replace org-pm-project-def-duplicates p-name
                        (add-to-list 'duplicates prev-proj-id)))))
    (setq org-publish-project-alist
          (assoc-replace org-publish-project-alist p-name p-def))
    (setq static-project
          (-flatten
           (-map
            (<span style="color: #728a05;">lambda</span> (pair)
              (list (intern (replace-regexp-in-string <span style="color: #259185;">"^:static_"</span> <span style="color: #259185;">":"</span>
                                                      (symbol-name (car pair))))
                    (cadr pair)))
                     (-filter
                      (<span style="color: #728a05;">lambda</span> (pair) (string-match <span style="color: #259185;">"^:static_"</span>
                                                   (symbol-name (car pair))))
                      (-partition 2 p-def)))))
    (setq static-project-name (concat <span style="color: #259185;">"static_"</span> p-name))
    (setq org-publish-project-alist
          (assoc-replace org-publish-project-alist
                         static-project-name static-project))
    (setq org-publish-project-alist
          (assoc-replace org-publish-project-alist
                         (concat <span style="color: #259185;">"combined-"</span> p-name)
                         (list <span style="color: #728a05;">:components</span>
                               p-name static-project-name))))
  project)
</pre>
</div>
</div>
</div>
