org-pm.html
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><a id="ID-24187886-5ADA-4263-806B-8655A9813C8B" name="ID-24187886-5ADA-4263-806B-8655A9813C8B"></a>org-pm-add-file-to-project:</h3>
<div class="outline-text-3" id="text-4-8">

<p>
Add file to current buffer to project interactively selected or input by user.
</p>

<p>
If project name input by user does not correspond to an existing project, offer to create that project.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-add-file-to-project</span> ()
  <span style="color: #465a61; font-style: italic;">"Add the file of the current buffer to a project selected or input by the user.</span>
<span style="color: #465a61; font-style: italic;">    If the project selected/input by the user is not already in the file's project list:</span>
<span style="color: #465a61; font-style: italic;">    - If no project of that name exists, request that the project be defined using</span>
<span style="color: #465a61; font-style: italic;">    org-pm or other methods.</span>
<span style="color: #465a61; font-style: italic;">    - If no project at all exists, then offer to create default project.</span>
<span style="color: #465a61; font-style: italic;">    - Add the selected project to the file's list in org-pm-files.</span>
<span style="color: #465a61; font-style: italic;">    - Save org-pm-files.</span>
<span style="color: #465a61; font-style: italic;">    - Add the project name to property PROJECT in file's header."</span>
  (interactive)
  (<span style="color: #728a05;">unless</span> (buffer-file-name (current-buffer))
    (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"This buffer is not associated with a file.  Please save first."</span>))
  (<span style="color: #728a05;">let*</span> ((org-completion-use-ido t)
         (projects
          (<span style="color: #728a05;">if</span> org-publish-project-alist
              (mapcar org-publish-project-alist 'car)
            (list org-pm-default-project-name)))
         (project-name
          (org-icompleting-read <span style="color: #259185;">"Choose or input a project name: "</span> projects)))
    (<span style="color: #728a05;">if</span> (member project-name (org-pm-get-file-projects))
        (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"This file is already part of project '%s'"</span> project-name))
    (setq project (org-pm-query-make-default-project project-name))
    (org-pm-add-project-to-file-header project-name)
    (org-pm-add-project-file project-name (buffer-file-name (current-buffer)))
    (org-pm-save-all-project-data)
    (org-pm-make-project-template project)
    (message
     <span style="color: #259185;">"Added project named: %s to file: %s\nBase directory is: %s\nPublishing directory i</span><span style="color: #706f6f; background-color: #042028;">s: %s"</span>
     project-name
     (file-name-nondirectory (buffer-file-name (current-buffer)))
     (plist-get (cdr project) <span style="color: #728a05;">:base-directory</span>)
     (plist-get (cdr project) <span style="color: #728a05;">:publishing-directory</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9">query-make-folder</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">query-make-folder</span> (path <span style="color: #a57705;">&amp;optional</span> prompt-string)
  <span style="color: #465a61; font-style: italic;">"If folder at path does not exist, then show dialog offering to user</span>
<span style="color: #465a61; font-style: italic;">    the option to create the indicated folder or to choose another path.</span>
<span style="color: #465a61; font-style: italic;">    If the path selected does not exist, create folder."</span>
  (setq path (file-truename path))
  (<span style="color: #728a05;">unless</span> prompt-string (setq prompt-string <span style="color: #259185;">"Folder select or create:"</span>))
  (<span style="color: #728a05;">let</span> ((answer
         (read-file-name
          (format
           <span style="color: #259185;">"%s\nSelect or input folder (folder will be created if needed):\n"</span>
           prompt-string)
          path)))
    (<span style="color: #728a05;">unless</span> (equal (file-truename answer) (buffer-file-name (current-buffer)))
      (setq path answer))
    (<span style="color: #728a05;">unless</span> (file-exists-p path) (make-directory path))
    path))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10">org-pm-remove-file-from-project:</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Remove file from project interactively selected by user.
</p>
</div>
</div>
<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11">org-pm-add-component-to-project</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Add current section (node) to a project interactively selected or input by user.
</p>

<p>
If project name input by user does not correspond to an existing project, offer to create that project.
</p>
</div>
</div>
<div id="outline-container-sec-4-12" class="outline-3">
<h3 id="sec-4-12">org-pm-remove-component-from-project</h3>
<div class="outline-text-3" id="text-4-12">
<p>
Remove current section (node) from a project interactively selected by user.
</p>
</div>
</div>
