org-pm.html
<div id="outline-container-sec-4-13" class="outline-3">
<h3 id="sec-4-13">org-pm-copy-components-to-projects</h3>
<div class="outline-text-3" id="text-4-13">
<ul class="org-ul">
<li>org-pm-copy-components can be called explicitly by the user as a command.
</li>
<li>If org-pm-auto-copy is enabled, then it is called automatically.
</li>
<li>There are two ways to automate the copying:
<ol class="org-ol">
<li>Copy whenever the file is saved.
</li>
<li>Copy whenever the project is published.
</li>
</ol>
</li>
</ul>

<p>
Assessment:
</p>

<p>
Version 1 lengthens the file saving time.
Version 1 lengthens the publishing time.
</p>

<p>
The accumulated delay of copying project components from all files when publishing may be more distracting than the delay of copying components of a single project.  Additionally, it is better to be able to check the condition of a project at any stage, and to have it updated as soon as a file is saved.  So I start by setting the default to copy components when the file is saved.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">Will replace org-pm-register-project-components.</span>
(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">*org-pm-missing-projects*</span> nil
<span style="color: #465a61; font-style: italic;">"Names of projects referenced in a file, whose definition is not found.</span>
<span style="color: #465a61; font-style: italic;">For reporting."</span>)

(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">*org-pm-updated-projects*</span> nil
  <span style="color: #465a61; font-style: italic;">"Names of projects to which components in a file were copied.</span>
<span style="color: #465a61; font-style: italic;">For reporting"</span>)

(<span style="color: #728a05;">defvar</span> <span style="color: #2075c7;">org-pm-report-after-copying-p</span> t
<span style="color: #465a61; font-style: italic;">"If not-nil, org-pm-copy-components-to-projects will post a report</span>
<span style="color: #465a61; font-style: italic;">of projects not found or of projects targeted when finishing."</span>)

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-copy-components-to-projects</span> (<span style="color: #a57705;">&amp;optional</span> do-not-save-now)
  <span style="color: #465a61; font-style: italic;">"Find which parts of the file go to which to projects, and copy them</span>
<span style="color: #465a61; font-style: italic;">to the base-directories of these projects.  Also save the projects found in</span>
<span style="color: #465a61; font-style: italic;">list org-pm-files for this project, using the full path of this file as key.</span>
<span style="color: #465a61; font-style: italic;">This list is saved and can be used later to update the contents of any project</span>
<span style="color: #465a61; font-style: italic;">by finding all the files that contribute to this project.</span>

<span style="color: #465a61; font-style: italic;">Parse current buffer, looking for projects added for the whole file (with property</span>
<span style="color: #465a61; font-style: italic;">=#+PROJECT:= or for sections (with tags enclosed in =_=). Collect names of all projects</span>
<span style="color: #465a61; font-style: italic;">found in a list. Put the list in the assoc list stored in =org-pm-files=, using the full</span>
<span style="color: #465a61; font-style: italic;">path of the file as key. Function =org-pm-copy-to-project= scans this list to find if</span>
<span style="color: #465a61; font-style: italic;">the file contains any components that should be copied to the project, and copies them.</span>

<span style="color: #465a61; font-style: italic;">components: List of file and/or ids of any sections that are copied to projects.</span>
<span style="color: #465a61; font-style: italic;">              Each element is of the form:</span>
<span style="color: #465a61; font-style: italic;">              (component (project folder file) (project folder file)...)</span>
<span style="color: #465a61; font-style: italic;">Components is added to org-pm-files and auto-saved."</span>

  (interactive)
  (<span style="color: #728a05;">let*</span> ((fullpath (buffer-file-name (current-buffer)))
        (filename (file-name-nondirectory fullpath))
        components file-components (origin-buffer (current-buffer)))
    (setq file-components
          (-map (<span style="color: #728a05;">lambda</span> (component) (org-pm-parse-component component filename))
                (org-get-header-property <span style="color: #259185;">"PROJECT"</span> t)))
    (org-map-entries
     '(<span style="color: #728a05;">let*</span> (name
             (node (cadr (org-element-at-point)))
             (pspecs (-filter (<span style="color: #728a05;">lambda</span> (tag) (string-match <span style="color: #259185;">"^_.*_$"</span> tag))
                              (plist-get node <span style="color: #728a05;">:tags</span>))))
        (<span style="color: #728a05;">when</span> pspecs
          (setq name (plist-get node <span style="color: #728a05;">:raw-value</span>))
          (setq components
                (cons
                 (cons
                  (plist-get node <span style="color: #728a05;">:begin</span>)
                  (-map
                   (<span style="color: #728a05;">lambda</span> (component) (org-pm-parse-component component name))
                   pspecs))
                 components)))))
    (<span style="color: #728a05;">if</span> file-components
        (setq components (cons (cons <span style="color: #259185;">"FILE"</span> file-components) components)))
    (setq org-pm-files (assoc-replace org-pm-files fullpath components))
    <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">first save, then do the copying:</span>
    (<span style="color: #728a05;">unless</span> do-not-save-now (org-pm-save-all-project-data))
    (setq *org-pm-missing-projects* nil)
    (setq *org-pm-updated-projects* nil)
    (<span style="color: #728a05;">dolist</span> (comp components)
      (<span style="color: #728a05;">let</span> ((pos (car comp))
            (target-buffer (get-buffer-create <span style="color: #259185;">"*org-pm-copy-buf*"</span>)))

        (<span style="color: #728a05;">cond</span> ((equal <span style="color: #259185;">"FILE"</span> pos)
               (set-buffer target-buffer)
               (insert-buffer origin-buffer)
               (<span style="color: #728a05;">dolist</span> (proj (cdr comp)) (org-pm-save-buffer proj target-buffer)))
             (t
              (set-buffer origin-buffer)
              (goto-char pos)
              (org-copy-subtree)
              (set-buffer target-buffer)
              (org-paste-subtree 1)
              (<span style="color: #728a05;">dolist</span> (proj (cdr comp)) (org-pm-save-buffer proj target-buffer))))
       (kill-buffer target-buffer)))
    (<span style="color: #728a05;">if</span> org-pm-report-after-copying-p
        (<span style="color: #728a05;">if</span> *org-pm-missing-projects*
         (grizzl-completing-read <span style="color: #259185;">"These projects could not be found"</span>
                                 (grizzl-make-index *org-pm-missing-projects*))
       (grizzl-completing-read <span style="color: #259185;">"Copied components to these projects"</span>
                               (grizzl-make-index *org-pm-updated-projects*))))
    (message <span style="color: #259185;">"Result: %s"</span> components)))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-parse-component</span> (component filename)
  (<span style="color: #728a05;">let</span> ((parts
         (-take 3 (split-string
                   (concat (replace-regexp-in-string <span style="color: #259185;">"#"</span> <span style="color: #259185;">"."</span> component) <span style="color: #259185;">"@@"</span>) <span style="color: #259185;">"@"</span>))))
    (setq parts
          (cons (replace-regexp-in-string
                 <span style="color: #259185;">"^_"</span> <span style="color: #259185;">""</span> (replace-regexp-in-string <span style="color: #259185;">"_$"</span> <span style="color: #259185;">""</span> (car parts)))
                (cdr parts)))
    (<span style="color: #728a05;">unless</span> (equal 0 (length (caddr parts)))
        (setq filename (caddr parts)))
    (setq filename (replace-regexp-in-string <span style="color: #259185;">" "</span> <span style="color: #259185;">"-"</span> filename))
    (<span style="color: #728a05;">unless</span> (string-match <span style="color: #259185;">".org$"</span> filename)
      (setq filename (concat filename <span style="color: #259185;">".org"</span>)))
    (setq parts (-replace-at 2 filename parts))
    parts))


(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-save-buffer</span> (specs buffer)
  (<span style="color: #728a05;">let</span> ((target-path (org-pm-make-target specs)))
    (make-directory (file-name-directory target-path) t)
    (write-region nil nil target-path)
    ))

<span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">superseded by org-pm-save-buffer:</span>
(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-copy-file</span> (specs <span style="color: #a57705;">&amp;optional</span> path-of-file-to-copy-from)
  <span style="color: #465a61; font-style: italic;">"Dopy the contents of file specified in path-of-filet-copy-from</span>
<span style="color: #465a61; font-style: italic;">to the target location given by specs.</span>
<span style="color: #465a61; font-style: italic;">If path-of-file-to-copy-from is nil, then copy the contents of the current</span>
<span style="color: #465a61; font-style: italic;">buffer.</span>
<span style="color: #465a61; font-style: italic;">NOTE: path-of-file-to-copy-from : NOT YET IMPLEMENTED."</span>
  (<span style="color: #728a05;">let</span> ((origin-buffer (current-buffer))
        (target-buffer (get-buffer-create <span style="color: #259185;">"*org-pm-copy-buf*"</span>))
        (target-path (org-pm-make-target specs)))
    (set-buffer target-buffer)
    (insert-buffer origin-buffer)
    <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">Shall we switch-on COMMENT for all exported sections here?</span>
    <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">Do READMORE conversion?</span>
    <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">(message "org-pm-copy-file copying to this path:\n %s" target-path)</span>
    (make-directory (file-name-directory target-path) t)
    (write-region nil nil target-path)
    (kill-buffer target-buffer)))

<span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">superseded by org-pm-save-buffer:</span>
(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-copy-section</span> (specs)
  (org-pm-make-target specs))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-make-target</span> (specs)
  (<span style="color: #728a05;">let*</span> ((project-name (car specs))
         (folder (cadr specs))
         (slash (<span style="color: #728a05;">if</span> (string-match <span style="color: #259185;">"/$"</span> folder) <span style="color: #259185;">""</span> <span style="color: #259185;">"/"</span>))
         (project (assoc project-name org-publish-project-alist)))
    (<span style="color: #728a05;">cond</span> (project
           (add-to-list '*org-pm-updated-projects* project-name)
           (concat (plist-get (cdr project) <span style="color: #728a05;">:base-directory</span>)
                   folder slash (caddr specs)))
          (t
           (add-to-list '*org-pm-missing-projects* project-name)
           nil))))

<span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">Fix grizzl-completing-read to display custom prompt</span>
(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">grizzl-completing-read</span> (prompt index)
  <span style="color: #465a61; font-style: italic;">"Performs a completing-read in the minibuffer using INDEX to fuzzy search.</span>
<span style="color: #465a61; font-style: italic;">Each key pressed in the minibuffer filters down the list of matches."</span>
  (minibuffer-with-setup-hook
      (<span style="color: #728a05;">lambda</span> ()
        (setq *grizzl-current-result* nil)
        (setq *grizzl-current-selection* 0)
        (grizzl-mode 1)
        (<span style="color: #728a05;">lexical-let*</span>
            ((hookfun (<span style="color: #728a05;">lambda</span> ()
                        (setq *grizzl-current-result*
                              (grizzl-search (minibuffer-contents)
                                             index
                                             *grizzl-current-result*))
                        (grizzl-display-result index prompt)))
             (exitfun (<span style="color: #728a05;">lambda</span> ()
                        (grizzl-mode -1)
                        (remove-hook 'post-command-hook    hookfun t))))
          (add-hook 'minibuffer-exit-hook exitfun nil t)
          (add-hook 'post-command-hook    hookfun nil t)))
    (read-from-minibuffer (<span style="color: #728a05;">if</span> prompt prompt <span style="color: #259185;">"&gt;&gt;&gt; "</span>))
    (grizzl-selected-result index)))
</pre>
</div>
</div>
</div>
