org-pm.html
<div id="outline-container-sec-4-14" class="outline-3">
<h3 id="sec-4-14"><a id="ID-688C2A25-277F-4263-95C9-FFFDA2F15E87" name="ID-688C2A25-277F-4263-95C9-FFFDA2F15E87"></a>org-pm-publish: Select a project to publish from the projects targeted by current buffer.</h3>
<div class="outline-text-3" id="text-4-14">

<p>
Since a file containing org-pm tags can be anywhere outside an org-mode project folder, one cannot use org-publish-current-project to automatically provide the target project based on the file.  Therefore, use <code>org-pm-publish</code> instead to select the desired project to publish from a list of projects that are targeted by the current file.
</p>
</div>
</div>
<div id="outline-container-sec-4-15" class="outline-3">
<h3 id="sec-4-15">org-pm-enable-auto:</h3>
</div>

<div id="outline-container-sec-4-16" class="outline-3">
<h3 id="sec-4-16"><a id="ID-5D8EF403-7567-4C82-B919-37ED86C3D268" name="ID-5D8EF403-7567-4C82-B919-37ED86C3D268"></a>org-pm-disable-auto:</h3>
<div class="outline-text-3" id="text-4-16">
</div>
</div>
<div id="outline-container-sec-4-17" class="outline-3">
<h3 id="sec-4-17">org-pm-list-dupicate-project-defs</h3>
<div class="outline-text-3" id="text-4-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-list-duplicate-project-defs</span> ()
  <span style="color: #465a61; font-style: italic;">"List project definitions of same name that are found in more than one file or section</span><span style="color: #706f6f; background-color: #042028;">.</span>
<span style="color: #465a61; font-style: italic;">Do this in a separate org-mode buffer, and provide links to both file and section."</span>

  (interactive)

  (<span style="color: #728a05;">if</span> (equal 0 (length org-pm-project-def-duplicates))
      (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"There are no duplicate project definitions at all.\n!!! ... YAyyy ... !!!"</span><span style="color: #706f6f; background-color: #042028;">))</span>

  (<span style="color: #728a05;">let</span> ((buffer (get-buffer-create <span style="color: #259185;">"*org-pm-project-def-duplicates*"</span>)))
    (switch-to-buffer buffer)
    (org-mode)
    (delete-region (point-min) (point-max))
    (org-insert-heading)
    (insert <span style="color: #259185;">"DUPLICATE PROJECT DEFINITIONS"</span>)
    (<span style="color: #728a05;">dolist</span> (project org-pm-project-def-duplicates)
      (<span style="color: #728a05;">let</span> ((project-name (car project)))
        (insert <span style="color: #259185;">"\n** "</span> project-name <span style="color: #259185;">"\n"</span>)
        (<span style="color: #728a05;">dolist</span> (def (cdr project))
          (<span style="color: #728a05;">let</span> ((path-and-id (split-string def <span style="color: #259185;">"::#"</span>)))
            (insert <span style="color: #259185;">"file: file:"</span> (car path-and-id) <span style="color: #259185;">"\n"</span>)
            (insert <span style="color: #259185;">"node: "</span> <span style="color: #259185;">"id:"</span> (cadr path-and-id) <span style="color: #259185;">"\n"</span>)))))
    ))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-18" class="outline-3">
<h3 id="sec-4-18">org-pm-list-project-defs</h3>
<div class="outline-text-3" id="text-4-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-list-project-defs</span> ()
  <span style="color: #465a61; font-style: italic;">"Build list of projects with links to file and node containing the project definition,</span>
<span style="color: #465a61; font-style: italic;">in a separate org-mode buffer, and provide links to both file and section.</span>
<span style="color: #465a61; font-style: italic;">Also list duplicate project definitions,</span>
<span style="color: #465a61; font-style: italic;">i.e. definitions of same name that are found in more than one file or section.</span>
<span style="color: #465a61; font-style: italic;">Note: static and combined projects created by the system</span>
<span style="color: #465a61; font-style: italic;">are not checked and added as duplicates by org-pm-check-add-project.</span>
<span style="color: #465a61; font-style: italic;">But they are in org-publish-project-alist, which we use for this list.</span>
<span style="color: #465a61; font-style: italic;">So we filter them out."</span>

  (interactive)

  (<span style="color: #728a05;">if</span> (equal 0 (length org-publish-project-alist))
      (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"There are no project definitions at all."</span>))

  (<span style="color: #728a05;">let</span> ((buffer (get-buffer-create <span style="color: #259185;">"*org-pm-project-definitions*"</span>))
        node-id dir)
    (switch-to-buffer buffer)
    (org-mode)
    (delete-region (point-min) (point-max))
    (org-insert-heading)
    (insert <span style="color: #259185;">"PROJECT DEFINITIONS"</span>)
    (<span style="color: #728a05;">dolist</span> (project (-remove (<span style="color: #728a05;">lambda</span> (proj)
                                (or (string-match <span style="color: #259185;">"^combined-"</span> (car proj))
                                    (string-match <span style="color: #259185;">"^static_"</span> (car proj))))
                              org-publish-project-alist))
      (setq node-id (plist-get (cdr project) <span style="color: #728a05;">:node-id</span>))
      (insert <span style="color: #259185;">"\n** "</span>
              (car project)
              <span style="color: #259185;">" (click [[elisp:(org-pm-search-link \""</span>
              (plist-get (cdr project) <span style="color: #728a05;">:project-id</span>)
              <span style="color: #259185;">"\")][*HERE*]] to edit definition)\n"</span>)
      (setq dir (plist-get (cdr project) <span style="color: #728a05;">:base-directory</span>))
      (insert <span style="color: #259185;">"base dir: [[elisp:(dired\""</span> dir <span style="color: #259185;">"\")]["</span> dir <span style="color: #259185;">"]]\n"</span> )
      (setq dir (plist-get (cdr project) <span style="color: #728a05;">:publishing-directory</span>))
      (insert <span style="color: #259185;">"publishing dir: [[elisp:(dired\""</span> dir <span style="color: #259185;">"\")]["</span> dir <span style="color: #259185;">"]]\n"</span> )
      (insert <span style="color: #259185;">"file: file:"</span> (plist-get (cdr project) <span style="color: #728a05;">:node-filename</span>) <span style="color: #259185;">"\n"</span>)
      (insert <span style="color: #259185;">"node: id:"</span> node-id <span style="color: #259185;">"\n"</span>)
      (<span style="color: #728a05;">let</span> ((duplicates (cdr (assoc (car project) org-pm-project-def-duplicates))))
        (<span style="color: #728a05;">if</span> duplicates
            (<span style="color: #728a05;">dolist</span> (def duplicates)
              (<span style="color: #728a05;">let</span> ((path-and-id (split-string def <span style="color: #259185;">"::#"</span>)))
                (insert <span style="color: #259185;">"\n*** duplicate: "</span>)
                (insert
                 <span style="color: #259185;">" (click [[elisp:(org-pm-search-link \""</span>
                 def
                 <span style="color: #259185;">"\")][*HERE*]] to edit)"</span>
                 )
                (insert <span style="color: #259185;">"\nfile: file:"</span> (car path-and-id) <span style="color: #259185;">"\n"</span>)
                (insert <span style="color: #259185;">"node: "</span> <span style="color: #259185;">"id:"</span> (cadr path-and-id) <span style="color: #259185;">"\n"</span>)))
          (insert <span style="color: #259185;">"\nThere no duplicate definitions for this project!\n"</span>))))))
</pre>
</div>
</div>

<div id="outline-container-sec-4-18-1" class="outline-4">
<h4 id="sec-4-18-1">org-pm-search-link</h4>
<div class="outline-text-4" id="text-4-18-1">
<p>
Currently, links to IDs that are not in org-link-locations are not found by org-mode.  <code>org-pm-search-link</code> finds such links by going to the file and then searching for the property with the id of the link.  It is used in org-pm-list-project-defs to enable jumping to links of duplicate project defs.  It can also be used for the same purpose in lists of components.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">org-pm-search-link</span> (link)
  (<span style="color: #728a05;">let</span> ((file-and-id (split-string link <span style="color: #259185;">"::#"</span>)))
    (find-file (car file-and-id))
    (beginning-of-buffer)
    (re-search-forward (concat <span style="color: #259185;">":ID: +"</span> (cadr file-and-id)))
    (org-back-to-heading)
    (org-show-subtree)
    (org-mark-element)
    (recenter-top-bottom 1)
    (message <span style="color: #259185;">"</span>
<span style="color: #259185;">---&gt; Marked the entire section containing project definition.</span>
<span style="color: #259185;">Type C-space C-space to de-select region and deactivate mark."</span>)))
</pre>
</div>
</div>
</div>
</div>
